# 10. 결측값 처리

In [1]:
# PANDAS 패키지 불러오기
import pandas as pd

sampleData = pd.read_excel("../dataset//missingValue.xlsx")
sampleData

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  NaN    20.0
1      A01  PRODUCT1     2  2.0     NaN
2      A01       NaN     3  NaN    10.0
3      A01  PRODUCT1     3  4.0     NaN

In [2]:
sampleData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   regionid  4 non-null      object
 1   product   3 non-null      object
 2   week      4 non-null      int64
 3   qty       2 non-null      float64
 4   target    2 non-null      float64
dtypes: float64(2), int64(1), object(2)
memory usage: 288.0+ bytes

### (1) 결측값 조회

In [3]:
sampleData.loc\
[ sampleData['product'].isnull() ]

  regionid product  week  qty  target
2      A01     NaN     3  NaN    10.0

In [4]:
sampleData.loc[sampleData.qty.isnull()]

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  NaN    20.0
2      A01       NaN     3  NaN    10.0

In [5]:
sampleData.isnull().sum()

regionid    0
product     1
week        0
qty         2
target      2
dtype: int64

In [6]:
# sampleData['qty'].isnull().sum()

# sampleData.notnull().sum()

### (2) 결측값 채우기

#### 1. 특정 값으로 채우기

In [7]:
# PANDAS 패키지 불러오기
import pandas as pd

sampleData = pd.read_excel("../dataset//missingValue.xlsx")
sampleData

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  NaN    20.0
1      A01  PRODUCT1     2  2.0     NaN
2      A01       NaN     3  NaN    10.0
3      A01  PRODUCT1     3  4.0     NaN

In [8]:
# 전체 null 값 0으로 채움
fillNaAll = sampleData.fillna(0)

# 특정컬럼(qty) na값으로 채움
sampleData["qty"] = sampleData.qty.fillna(0)
sampleData

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  0.0    20.0
1      A01  PRODUCT1     2  2.0     NaN
2      A01       NaN     3  0.0    10.0
3      A01  PRODUCT1     3  4.0     NaN

#### 2. 특정 순서로 채우기

In [9]:
# PANDAS 패키지 불러오기
import pandas as pd

sampleData = pd.read_excel("../dataset//missingValue.xlsx")

#  위에 데이터로 아래 채우기
print(sampleData.fillna(method="ffill"))

#  아래 데이터로 위 채우기
print(sampleData.fillna(method="bfill"))

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  NaN    20.0
1      A01  PRODUCT1     2  2.0    20.0
2      A01  PRODUCT1     3  2.0    10.0
3      A01  PRODUCT1     3  4.0    10.0
  regionid   product  week  qty  target
0      A01  PRODUCT1     1  2.0    20.0
1      A01  PRODUCT1     2  2.0    10.0
2      A01  PRODUCT1     3  4.0    10.0
3      A01  PRODUCT1     3  4.0     NaN

#### 3. 평균 값으로 채우기

In [10]:
sampleData.fillna(sampleData.mean())

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  3.0    20.0
1      A01  PRODUCT1     2  2.0    15.0
2      A01       NaN     3  3.0    10.0
3      A01  PRODUCT1     3  4.0    15.0

In [11]:
sampleData

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  NaN    20.0
1      A01  PRODUCT1     2  2.0     NaN
2      A01       NaN     3  NaN    10.0
3      A01  PRODUCT1     3  4.0     NaN

In [12]:
sampleData.where(pd.notnull(sampleData), sampleData.mean(), axis='columns')

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  3.0    20.0
1      A01  PRODUCT1     2  2.0    15.0
2      A01       NaN     3  3.0    10.0
3      A01  PRODUCT1     3  4.0    15.0

In [13]:
sampleData.fillna(sampleData.mean()['qty':'target'])

  regionid   product  week  qty  target
0      A01  PRODUCT1     1  3.0    20.0
1      A01  PRODUCT1     2  2.0    15.0
2      A01       NaN     3  3.0    10.0
3      A01  PRODUCT1     3  4.0    15.0

#### 4. 다른 컬럼의 값으로 채우기

In [14]:
import numpy as np

sampleData['new_qty'] = np.where(pd.notnull(sampleData['qty']) == True, 
                                 sampleData['qty'], sampleData['target'])
sampleData['new_target'] = np.where(pd.notnull(sampleData['target']) == True, sampleData['target'], 
                                    sampleData['qty'])
sampleData

  regionid   product  week  qty  target  new_qty  new_target
0      A01  PRODUCT1     1  NaN    20.0     20.0        20.0
1      A01  PRODUCT1     2  2.0     NaN      2.0         2.0
2      A01       NaN     3  NaN    10.0     10.0        10.0
3      A01  PRODUCT1     3  4.0     NaN      4.0         4.0

In [15]:
sampleData

  regionid   product  week  qty  target  new_qty  new_target
0      A01  PRODUCT1     1  NaN    20.0     20.0        20.0
1      A01  PRODUCT1     2  2.0     NaN      2.0         2.0
2      A01       NaN     3  NaN    10.0     10.0        10.0
3      A01  PRODUCT1     3  4.0     NaN      4.0         4.0